{
  "backend/main.mo": "Motoko canister implementing access-controlled family membership and a family-only chat with message posting and pagination.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test references.",
  "frontend-file-summaries.txt": "A JSON-like summary list describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme tokens with a custom OKLCH color palette.",
  "frontend/index.html": "HTML entry point that sets metadata, links the PWA manifest and icons, and loads the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app name, appearance, colors, start URL, and icons for installability.",
  "frontend/public/sw.js": "Service worker providing caching for static assets, network-first for API calls, and offline fallbacks.",
  "frontend/src/App.tsx": "Top-level React component applying theming, authentication gating, service worker registration, and rendering the new app placeholder.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI component showing an access denied alert with optional back navigation.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks admin status and blocks access with an error screen if unauthorized.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that shows loading, sign-in UI, or the app depending on Internet Identity state.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flows with loading and error states.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, footer, and identity-aware UI elements such as login and install buttons.",
  "frontend/src/components/pwa/InstallEntryPoint.tsx": "Displays install options for the PWA, showing either an install button or a help dialog depending on platform support.",
  "frontend/src/features/auth/hooks/useAdminStatus.ts": "Checks whether the current actor is an admin using react-query and returns admin status and loading state.",
  "frontend/src/features/auth/hooks/useMembershipStatus.ts": "Fetches membership status for the current user and exposes member flag, loading state, and fetch status.",
  "frontend/src/features/chat/ChatPage.tsx": "Renders the chat UI with membership gating, message list, auto-scrolling, and message sending functionality.",
  "frontend/src/features/chat/hooks/useChatMessages.ts": "Fetches chat messages from the backend with polling and exposes messages, loading state, and refetch function.",
  "frontend/src/features/chat/hooks/usePostMessage.ts": "Provides a mutation for posting messages, including validation, success handling, and cache invalidation.",
  "frontend/src/features/newApp/NewAppPlaceholderPage.tsx": "A placeholder page allowing users to describe their app idea and shows a confirmation when captured.",
  "frontend/src/features/settings/FamilySettingsPage.tsx": "UI for managing family members, including listing, adding, removing members, and validating principal inputs.",
  "frontend/src/features/settings/hooks/useFamilyMembers.ts": "Manages family member list queries and mutations for adding/removing members with toast notifications.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, handling initialization and dependent query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login state and identity persistence using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base imports and theme variables for light and dark color schemes with custom OKLCH palette.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker in production, handles updates, and logs registration status.",
  "frontend/src/pwa/useInstallPrompt.ts": "React hook that captures and exposes the PWA install prompt, tracking installability and installation state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color tokens, extended components, and plugins.",
  "project_state.json": "Metadata describing the project state, existing features, and pending new app creation request."
}